app/views/items/index.html.erb

SELECT `categories`.* FROM `categories`
---
               <ul class="catul">
            	  <% Category.all.each do |category| %>