app/controllers/items_controller.rb

  def index
		@items = Item.all #select * by category
---
SELECT `items`.* FROM `items`

	def show
		@item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

	def edit
		@item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1